// `for` هي صيغة التكرار الوحيدة في Go. إليك بعض
// الأنواع الأساسية لحلقات `for`.

package main

import "fmt"

func main() {

	// أبسط الأنواع، ويحتوي على شرط واحد.
	i := 1
	for i <= 3 {
		fmt.Println(i)
		i = i + 1
	}

	// حلقة `for` تقليدية بأجزاء التهيئة والشرط
	// وما بعد التكرار.
	for j := 0; j < 3; j++ {
		fmt.Println(j)
	}

	// هناك طريقة أخرى لتنفيذ تكرار بسيط من نوع "نفّذ
	// هذا `N` مرة"، وهي استخدام `range` مع عدد صحيح.
	for i := range 3 {
		fmt.Println("range", i)
	}

	// تستمر `for` التي لا تحتوي على شرط في التكرار حتى
	// تخرج من الحلقة باستخدام `break` أو تخرج من الدالة
	// المحيطة باستخدام `return`.
	for {
		fmt.Println("loop")
		break
	}

	// يمكنك أيضًا الانتقال إلى التكرار التالي من الحلقة
	// باستخدام `continue`.
	for n := range 6 {
		if n%2 == 0 {
			continue
		}
		fmt.Println(n)
	}
}
