// تتضمن Go أنواعًا متعددة من القيم، منها السلاسل النصية
// والأعداد الصحيحة وأعداد الفاصلة العائمة والقيم المنطقية
// وغيرها. إليك بعض الأمثلة الأساسية.

package main

import "fmt"

func main() {

	// السلاسل النصية، ويمكن جمعها معًا باستخدام `+`.
	fmt.Println("go" + "lang")

	// الأعداد الصحيحة وأعداد الفاصلة العائمة.
	fmt.Println("1+1 =", 1+1)
	fmt.Println("7.0/3.0 =", 7.0/3.0)

	// القيم المنطقية، مع المعاملات المنطقية المعتادة.
	fmt.Println(true && false)
	fmt.Println(true || false)
	fmt.Println(!true)
}
