// توفر Go دعمًا ممتازًا لتنسيق السلاسل النصية وفق نهج `printf`.
// إليك بعض الأمثلة على مهام تنسيق السلاسل النصية الشائعة.

package main

import (
	"fmt"
	"os"
)

type point struct {
	x, y int
}

func main() {

	// توفر Go عدة «أفعال» طباعة مصممة لتنسيق قيم Go العامة.
	// يطبع هذا مثلًا نسخة من الهيكل `point` لدينا.
	p := point{1, 2}
	fmt.Printf("struct1: %v\n", p)

	// إذا كانت القيمة هيكلًا، فستتضمن الصيغة `%+v` أسماء حقول
	// الهيكل.
	fmt.Printf("struct2: %+v\n", p)

	// تطبع الصيغة `%#v` تمثيل القيمة بصياغة Go، أي مقطع الكود
	// المصدري الذي يُنتج تلك القيمة.
	fmt.Printf("struct3: %#v\n", p)

	// لطباعة نوع قيمة، استخدم `%T`.
	fmt.Printf("type: %T\n", p)

	// تنسيق القيم المنطقية مباشر.
	fmt.Printf("bool: %t\n", true)

	// توجد خيارات كثيرة لتنسيق الأعداد الصحيحة. استخدم `%d`
	// للتنسيق القياسي ذي الأساس 10.
	fmt.Printf("int: %d\n", 123)

	// يطبع هذا تمثيلًا ثنائيًا.
	fmt.Printf("bin: %b\n", 14)

	// يطبع هذا المحرف المقابل للعدد الصحيح المعطى.
	fmt.Printf("char: %c\n", 33)

	// يوفر `%x` ترميزًا سداسيًا عشريًا.
	fmt.Printf("hex: %x\n", 456)

	// توجد أيضًا عدة خيارات لتنسيق أعداد الفاصلة العائمة. استخدم
	// `%f` للتنسيق العشري الأساسي.
	fmt.Printf("float1: %f\n", 78.9)

	// ينسق `%e` و`%E` عدد الفاصلة العائمة بصيغتين مختلفتين قليلًا
	// من التدوين العلمي.
	fmt.Printf("float2: %e\n", 123400000.0)
	fmt.Printf("float3: %E\n", 123400000.0)

	// استخدم `%s` للطباعة الأساسية للسلاسل النصية.
	fmt.Printf("str1: %s\n", "\"string\"")

	// استخدم `%q` لإحاطة السلاسل النصية بعلامتي اقتباس مزدوجتين
	// كما في كود Go المصدري.
	fmt.Printf("str2: %q\n", "\"string\"")

	// كما رأينا مع الأعداد الصحيحة، يعرض `%x` السلسلة النصية
	// بالأساس 16، بمحرفي خرج لكل بايت من المدخلات.
	fmt.Printf("str3: %x\n", "hex this")

	// لطباعة تمثيل لمؤشر، استخدم `%p`.
	fmt.Printf("pointer: %p\n", &p)

	// عند تنسيق الأعداد، ستحتاج غالبًا إلى التحكم في عرض العدد
	// الناتج ودقته. لتحديد عرض عدد صحيح، ضع عددًا بعد `%` في فعل
	// التنسيق. تُحاذى النتيجة افتراضيًا إلى اليمين وتُحشى بمسافات.
	fmt.Printf("width1: |%6d|%6d|\n", 12, 345)

	// يمكنك أيضًا تحديد عرض أعداد الفاصلة العائمة المطبوعة، لكنك
	// سترغب عادة في تقييد الدقة العشرية في الوقت نفسه باستخدام
	// الصياغة `width.precision`.
	fmt.Printf("width2: |%6.2f|%6.2f|\n", 1.2, 3.45)

	// للمحاذاة إلى اليسار، استخدم الخيار `-`.
	fmt.Printf("width3: |%-6.2f|%-6.2f|\n", 1.2, 3.45)

	// قد ترغب أيضًا في التحكم في العرض عند تنسيق السلاسل النصية،
	// ولا سيما لضمان محاذاتها في خرج شبيه بالجدول. هذا عرض أساسي
	// محاذى إلى اليمين.
	fmt.Printf("width4: |%6s|%6s|\n", "foo", "b")

	// للمحاذاة إلى اليسار، استخدم الخيار `-` كما مع الأعداد.
	fmt.Printf("width5: |%-6s|%-6s|\n", "foo", "b")

	// رأينا حتى الآن `Printf`، التي تطبع السلسلة النصية المنسقة
	// إلى `os.Stdout`. تنسق `Sprintf` سلسلة نصية وتعيدها دون
	// طباعتها في أي مكان.
	s := fmt.Sprintf("sprintf: a %s", "string")
	fmt.Println(s)

	// يمكنك استخدام `Fprintf` للتنسيق والطباعة إلى كائنات
	// `io.Writer` غير `os.Stdout`.
	fmt.Fprintf(os.Stderr, "io: an %s\n", "error")
}
