// تُعد [خيارات سطر الأوامر](https://ar.wikipedia.org/wiki/واجهة_سطر_الأوامر)
// طريقة شائعة لتحديد خيارات برامج سطر الأوامر. في `wc -l` مثلًا،
// يُعد `-l` خيارًا لسطر الأوامر.

package main

// توفر Go الحزمة `flag` لدعم التحليل الأساسي لخيارات سطر
// الأوامر. سنستخدم هذه الحزمة لتنفيذ مثالنا على برنامج سطر أوامر.
import (
	"flag"
	"fmt"
)

func main() {

	// تتوفر تصريحات أساسية لخيارات السلاسل النصية والأعداد الصحيحة
	// والقيم المنطقية. نصرّح هنا بخيار السلسلة النصية `word`، مع
	// القيمة الافتراضية `"foo"` ووصف مختصر. تعيد الدالة
	// `flag.String` مؤشرًا إلى سلسلة نصية، لا قيمة سلسلة نصية؛
	// وسنرى أدناه كيفية استخدام هذا المؤشر.
	wordPtr := flag.String("word", "foo", "a string")

	// يصرّح هذا بالخيارين `numb` و`fork` باتباع أسلوب شبيه بخيار
	// `word`.
	numbPtr := flag.Int("numb", 42, "an int")
	forkPtr := flag.Bool("fork", false, "a bool")

	// يمكن أيضًا التصريح بخيار يستخدم متغيرًا موجودًا صُرّح به في
	// موضع آخر من البرنامج. لاحظ أن علينا تمرير مؤشر إلى دالة
	// التصريح بالخيار.
	var svar string
	flag.StringVar(&svar, "svar", "bar", "a string var")

	// بعد التصريح بجميع الخيارات، استدعِ `flag.Parse()` لتنفيذ
	// تحليل سطر الأوامر.
	flag.Parse()

	// سنطبع هنا الخيارات المحللة وأي وسائط موضعية لاحقة. لاحظ أن
	// علينا فك إشارة المؤشرات، باستخدام `*wordPtr` مثلًا، للحصول
	// على قيم الخيارات الفعلية.
	fmt.Println("word:", *wordPtr)
	fmt.Println("numb:", *numbPtr)
	fmt.Println("fork:", *forkPtr)
	fmt.Println("svar:", svar)
	fmt.Println("tail:", flag.Args())
}
