// _الخرائط_ هي [نوع البيانات الترابطي](https://ar.wikipedia.org/wiki/مصفوفة_ارتباطية)
// المدمج في Go (وتسمى أحيانًا _جداول التجزئة_ أو _القواميس_
// في لغات أخرى).

package main

import (
	"fmt"
	"maps"
)

func main() {

	// لإنشاء خريطة فارغة، استخدم الدالة المدمجة `make`:
	// `make(map[key-type]val-type)`.
	m := make(map[string]int)

	// أسند أزواج المفاتيح والقيم باستخدام الصيغة المعتادة
	// `name[key] = val`.
	m["k1"] = 7
	m["k2"] = 13

	// تعرض طباعة خريطة باستخدام `fmt.Println` مثلًا جميع
	// أزواج المفاتيح والقيم فيها.
	fmt.Println("map:", m)

	// احصل على قيمة مفتاح باستخدام `name[key]`.
	v1 := m["k1"]
	fmt.Println("v1:", v1)

	// إذا لم يكن المفتاح موجودًا، تُعاد
	// [القيمة الصفرية](https://go.dev/ref/spec#The_zero_value)
	// لنوع القيمة.
	v3 := m["k3"]
	fmt.Println("v3:", v3)

	// تعيد الدالة المدمجة `len` عدد أزواج المفاتيح والقيم
	// عند استدعائها على خريطة.
	fmt.Println("len:", len(m))

	// تحذف الدالة المدمجة `delete` أزواج المفاتيح والقيم
	// من الخريطة.
	delete(m, "k2")
	fmt.Println("map:", m)

	// لحذف *جميع* أزواج المفاتيح والقيم من خريطة، استخدم
	// الدالة المدمجة `clear`.
	clear(m)
	fmt.Println("map:", m)

	// تشير قيمة الإرجاع الثانية الاختيارية عند جلب قيمة من
	// خريطة إلى وجود المفتاح فيها. ويمكن استخدامها للتمييز
	// بين المفاتيح الغائبة والمفاتيح ذات القيم الصفرية مثل
	// `0` أو `""`. لم نحتج هنا إلى القيمة نفسها، لذلك
	// تجاهلناها باستخدام _المعرّف الفارغ_ `_`.
	_, prs := m["k2"]
	fmt.Println("prs:", prs)

	// يمكنك أيضًا التصريح عن خريطة جديدة وتهيئتها في السطر
	// نفسه باستخدام هذه الصيغة.
	n := map[string]int{"foo": 1, "bar": 2}
	fmt.Println("map:", n)

	// تحتوي الحزمة `maps` على عدد من الدوال المساعدة
	// المفيدة للخرائط.
	n2 := map[string]int{"foo": 1, "bar": 2}
	if maps.Equal(n, n2) {
		fmt.Println("n == n2")
	}
}
