# عند تشغيل برنامجنا، نرى معالجة الدفعة الأولى من الطلبات بمعدل
# طلب واحد كل نحو 200 مللي ثانية كما أردنا.
$ go run rate-limiting.go
request 1 2012-10-19 00:38:18.687438 +0000 UTC
request 2 2012-10-19 00:38:18.887471 +0000 UTC
request 3 2012-10-19 00:38:19.087238 +0000 UTC
request 4 2012-10-19 00:38:19.287338 +0000 UTC
request 5 2012-10-19 00:38:19.487331 +0000 UTC

# في الدفعة الثانية من الطلبات، نخدم الطلبات الثلاثة الأولى فورًا
# لأن تحديد المعدل يسمح بالدفعات، ثم نخدم الطلبين المتبقيين
# بفاصل يبلغ نحو 200 مللي ثانية لكل منهما.
request 1 2012-10-19 00:38:20.487578 +0000 UTC
request 2 2012-10-19 00:38:20.487645 +0000 UTC
request 3 2012-10-19 00:38:20.487676 +0000 UTC
request 4 2012-10-19 00:38:20.687483 +0000 UTC
request 5 2012-10-19 00:38:20.887542 +0000 UTC
