// يُصرّح عن _المتغيرات_ في Go تصريحًا صريحًا، ويستخدمها
// المترجم للتحقق، مثلًا، من توافق أنواع استدعاءات الدوال.

package main

import "fmt"

func main() {

	// تصرّح `var` عن متغير واحد أو أكثر.
	var a = "initial"
	fmt.Println(a)

	// يمكنك التصريح عن عدة متغيرات دفعة واحدة.
	var b, c int = 1, 2
	fmt.Println(b, c)

	// تستنتج Go نوع المتغيرات التي جرت تهيئتها.
	var d = true
	fmt.Println(d)

	// تأخذ المتغيرات المصرّح عنها دون تهيئة مقابلة
	// _القيمة الصفرية_. فمثلًا، القيمة الصفرية للنوع
	// `int` هي `0`.
	var e int
	fmt.Println(e)

	// الصيغة `:=` اختصار للتصريح عن متغير وتهيئته؛ وهي
	// تكافئ هنا `var f string = "apple"`.
	// لا تتاح هذه الصيغة إلا داخل الدوال.
	f := "apple"
	fmt.Println(f)
}
