// تدعم Go تنسيق الوقت وتحليله عبر تخطيطات قائمة على الأنماط.

package main

import (
	"fmt"
	"time"
)

func main() {
	p := fmt.Println

	// هذا مثال أساسي على تنسيق وقت وفق RFC3339 باستخدام ثابت
	// التخطيط المقابل.
	t := time.Now()
	p(t.Format(time.RFC3339))

	// يستخدم تحليل الوقت قيم التخطيط نفسها التي تستخدمها `Format`.
	t1, _ := time.Parse(time.RFC3339, "2012-11-01T22:08:41+00:00")
	p(t1)

	// تستخدم `Format` و`Parse` تخطيطات قائمة على الأمثلة. ستستخدم
	// عادة ثابتًا من `time` لهذه التخطيطات، لكن يمكنك أيضًا توفير
	// تخطيطات مخصصة. يجب أن تستخدم التخطيطات الوقت المرجعي
	// `Mon Jan 2 15:04:05 MST 2006` لإظهار نمط تنسيق أو تحليل وقت
	// أو سلسلة نصية معينة. يجب أن يكون وقت المثال كما هو موضح
	// تمامًا: السنة 2006 والساعة 15 والاثنين بوصفه يوم الأسبوع،
	// وهكذا.
	p(t.Format("3:04PM"))
	p(t.Format("Mon Jan _2 15:04:05 2006"))
	p(t.Format("2006-01-02T15:04:05.999999-07:00"))
	form := "3 04 PM"
	t2, _ := time.Parse(form, "8 41 PM")
	p(t2)

	// للتمثيلات الرقمية البحتة، يمكنك أيضًا استخدام تنسيق السلاسل
	// النصية القياسي مع المكونات المستخرجة من قيمة الوقت.
	fmt.Printf("%d-%02d-%02dT%02d:%02d:%02d-00:00\n",
		t.Year(), t.Month(), t.Day(),
		t.Hour(), t.Minute(), t.Second())

	// ستعيد `Parse` خطأ يوضح مشكلة التحليل إذا كانت المدخلات غير
	// صالحة.
	_, err := time.Parse("Mon Jan _2 15:04:05 2006", "8:41PM")
	p(err)
}
