// تشير `panic` عادة إلى حدوث خطأ غير متوقع. نستخدمها غالبًا
// للإخفاق السريع عند أخطاء لا ينبغي أن تحدث أثناء التشغيل
// العادي، أو لسنا مستعدين لمعالجتها بسلاسة.

package main

import (
	"os"
	"path/filepath"
)

func main() {

	// سنستخدم `panic` في أنحاء هذا الموقع للتحقق من الأخطاء غير
	// المتوقعة. هذا هو البرنامج الوحيد في الموقع المصمم لاستدعاء
	// `panic`.
	panic("a problem")

	// من الاستخدامات الشائعة لـ`panic` إيقاف التنفيذ إذا أعادت
	// دالة قيمة خطأ لا نعرف كيف نعالجها، أو لا نريد معالجتها.
	// يوضح الآتي استدعاء `panic` عند حدوث خطأ غير متوقع أثناء
	// إنشاء ملف جديد.
	path := filepath.Join(os.TempDir(), "file")
	_, err := os.Create(path)
	if err != nil {
		panic(err)
	}
}
